core/doc/manual.org
#+TITLE: Bandit Test Writing Manual
# #+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [12pt,a4paper,koma]
#+LATEX_HEADER: \usepackage{fullpage}
#+OPTIONS: ^:nil

#+LaTeX: \begin{abstract}
Bandit is a simple structure for writing correctness tests. It uses a
simple, straight forward CSV style format for structuring a series of
synchronous, serial steps.  It is not the purpose of Bandit to perform
performance tests, which should be mostly asynchronous. Bandit is also
designed to be an outside observer, which is only able to observe the
actions of the system(s) under test. It a goal Bandit that except for
shell scripts, no code should be written to test a system, by using
simple generic components and simple reasoning.
#+LaTeX: \end{abstract}

* Introduction to Bandit

The format of this document is that each section following this one will
be written:
- Configuration: A section on the module configurations
- Test: Actions and their arguments for each module
In that vein this portion of the document covers this information in
brief for all modules.

** Configuration

   Configuration tests should be written against environments, and tests
   should be as abstracted as possible from these environments. It is
   not always possible, and tests have no mutable features.

   Configurations are written as Clojure maps. The reason for this is to
   allow for certain language features, should they be useful, such as
   allowing modules to require functions to be passed in for more
   elaborate capabilities.

   In order for modules to be activated, and thus for their features to
   be available in tests, they must minimally be represented with a
   structure:
#+BEGIN_EXAMPLE
   { "module" {} }
#+END_EXAMPLE
   This means that the above module ``module'' has no arguments. A
   better example would be this:

#+BEGIN_EXAMPLE
     { "rest" {}}
#+END_EXAMPLE
   As the shell module has no arguments.

** Test

   All test modules have the following format:
#+BEGIN_EXAMPLE
     identifier|module|action|argument{|arguments}*
#+END_EXAMPLE
   Where:
     - identifier :: A string of the writer's choosing to desribe this
       step of the test, intended to aid the readability of output.
     - module :: The module that runs this step.
     - action :: The action the module should perform.
     - argument :: All actions have at least one required argument.
     - arguments :: Most actions take more than one argument, and many
       will take varargs.

Test steps are performed one after the other. A step will always be completed
when pass is displayed (although scripts may launch background processes, or
the system under test could still be processing messages from a message broker).

Tests can also contain blank lines and also any line beginning with # is
treated as a comment.

* Rest Module
  The rest module allows for testing rest interfaces using the common verbs
  GET, POST, PUT, and DELETE. Each of these are defined as an action.

** Configuration

Takes alias for beginnings of urls.

#+BEGIN_EXAMPLE
{"rest" {
  "alias" "http://localhost:8181"
}}
#+END_EXAMPLE

One or more aliases can be provided, so that tests can be written
environmentally agnostic.

** Test

   Actions are one of:
   1. get
   2. post
   3. delete
   4. put

   All tests using the rest module will have rest in the second field of the
   test csv. The rest module assumes responses in JSON format.

   All actions have the same set of arguments:
#+BEGIN_EXAMPLE
alias|url|body|code{|regex}+
#+END_EXAMPLE

Where:
  - alias :: An alias that references the beginning of a url to be
             prepended to it.
  - url :: The url to test.
  - body :: A body to send with the resut query (may be empty).
  - code :: Expected status code (this is tested against a field within the
    returned JSON body).
  - regex :: Regular expressions ran against the result, of which all must pass.
    If regex has a ! as the first character, it will attempt to negate the match.

* Mongo Module
  This module provides a number of features for testing or waiting for data
  in MongoDB.

** Configuration
   Example of all features:
#+BEGIN_EXAMPLE
{
  "mongo" {
    "host" "localhost"
    "port" 27017
    "writeable" true
    "db-user-pass" [{"user" "some"
      "password" "one"
      "db" "test"}]
  }
}
#+END_EXAMPLE
Where:
  - host :: The hostname running the mongodb that should be ran against.
  - port :: The port number for mongodb.
  - writeable :: Setting this to true (no quotes) enables destructive mongodb
    operations. In case live tests are setup, this will prevent damaging
    environments by allowing potentially catastrophic operations run. If
    not set, or if set to anything other than ~true~.
  - db-user-pass :: The username, password, and database for authorization.
    db :: Database to authenticate against.
    user :: Username to authenticate with.
    password :: Password to authenticate with.

** Test
The mongo module has various different actions for dealing with different needs
on mongodb. Only a handful are potentially destructive, and these actions are
managed by the *"writeable"* configuration setting.

All actions have the following arguments after the action argument:
#+BEGIN_EXAMPLE
db|collection
#+END_EXAMPLE

Where:
  - db :: The database to use for this action.
  - collection :: The collection to use for this action.

All following argument lists will include all arguments, for simplicity
of reading.

*** compare Action

This action compares two different records (excluding certain fields) to see
if they are the same based on clojure value comparisons. Used to check if a
sequence of actions is equivalent to simply processing the last document of
a series in our testing.

Arguments are:
#+BEGIN_EXAMPLE
id|mongo|compare|db|collection|query1|query2{|excludes}+
#+END_EXAMPLE

Where:
  - query1 :: A strict (keys must be wrapped in quotes) JSON query document for
    a single document that has to be compared.
  - query2 :: A strict (keys must be wrapped in quotes) JSON query document for
    a single document that has to be compared.
  - excludes :: Fields to be excluded from the comparison. By design _id must
    be specified minimally, but any number of pipe delimited excludes may be
    included.

*** count Action
This action counts all documents in a collection and compares it to an
expected number of documents.

Arguments are:
#+BEGIN_EXAMPLE
id|mongo|count|db|collection|expectation
#+END_EXAMPLE

Where:
  - expectation :: The number of documents expected to be in the collection.

*** exists Action
Waits for a document to appear in the document, based on a standard query.
One of the few actions that wait a set maximum time (no minimum) for an
external action to be completed.

Arguments are:
#+BEGIN_EXAMPLE
id|mongo|exists|db|collection|query|wait
#+END_EXAMPLE

Where:
  - query :: A strictly formatted JSON document to find the document.
  - wait :: The maximum amount of time to wait for the document to appear
    in the database.

*** remove Action
Remove all documents from a mongo db database, based on a query. Requires
*"writeable"* to be set.

Arguments are:
#+BEGIN_EXAMPLE
id|mongo|remove|db|collection{|queries}+
#+END_EXAMPLE

Where:
  - queries :: One or more pipe delimitted queries describing the documents
    to remove from the collection.

