core/doc/manual.tex
% Created 2014-11-06 Thu 08:56
\documentclass[12pt,a4paper,koma]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage[normalem]{ulem}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{amstext}
\usepackage{hyperref}
\tolerance=1000
\usepackage{fullpage}
\author{Raymond Poling}
\date{\today}
\title{Bandit Test Writing Manual}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.0)}}
\begin{document}

\maketitle
\tableofcontents

\begin{abstract}
Bandit is a simple structure for writing correctness tests. It uses a
simple, straight forward CSV style format for structuring a series of
synchronous, serial steps.  It is not the purpose of Bandit to perform
performance tests, which should be mostly asynchronous. Bandit is also
designed to be an outside observer, which is only able to observe the
actions of the system(s) under test. It a goal Bandit that except for
shell scripts, no code should be written to test a system, by using
simple generic components and simple reasoning.
\end{abstract}

\section{Introduction to Bandit}
\label{sec-1}

The format of this document is that each section following this one will
be written:
\begin{itemize}
\item Configuration: A section on the module configurations
\item Test: Actions and their arguments for each module
\end{itemize}
In that vein this portion of the document covers this information in
brief for all modules.

\subsection{Configuration}
\label{sec-1-1}

Configuration tests should be written against environments, and tests
should be as abstracted as possible from these environments. It is
not always possible, and tests have no mutable features.

Configurations are written as Clojure maps. The reason for this is to
allow for certain language features, should they be useful, such as
allowing modules to require functions to be passed in for more
elaborate capabilities.

In order for modules to be activated, and thus for their features to
be available in tests, they must minimally be represented with a
structure:
\begin{verbatim}
{ "module" {} }
\end{verbatim}
This means that the above module ``module'' has no arguments. A
better example would be this:

\begin{verbatim}
{ "rest" {}}
\end{verbatim}
As the rest module has no arguments.
\subsection{Test}
\label{sec-1-2}

All test modules have the following format:
\begin{verbatim}
identifier|module|action|argument{|arguments}*
\end{verbatim}
Where:
\begin{description}
\item[{identifier}] A string of the writer's choosing to desribe this
step of the test, intended to aid the readability of output.
\item[{module}] The module that runs this step.
\item[{action}] The action the module should perform.
\item[{argument}] All actions have at least one required argument.
\item[{arguments}] Most actions take more than one argument, and many
will take varargs.
\end{description}

Test steps are performed one after the other. A step will always be completed
when pass is displayed (although scripts may launch background processes, or
the system under test could still be processing messages from a message broker).

Tests can also contain blank lines and also any line beginning with \# is
treated as a comment.
\section{Rest Module}
\label{sec-2}
The rest module allows for testing rest interfaces using the common verbs
GET, POST, PUT, and DELETE. Each of these are defined as an action.

\subsection{Configuration}
\label{sec-2-1}

No options, to ativate:

\begin{verbatim}
{"rest" {}}
\end{verbatim}
\subsection{Test}
\label{sec-2-2}

Actions are one of:
\begin{enumerate}
\item get
\item post
\item delete
\item put
\end{enumerate}

All tests using the rest module will have rest in the second field of the
test csv. The rest module assumes responses in JSON format.

All actions have the same set of arguments:
\begin{verbatim}
url|body|code{|regex}+
\end{verbatim}

Where:
\begin{description}
\item[{url}] The url to test.
\item[{body}] A body to send with the resut query (may be empty).
\item[{code}] Expected status code (this is tested against a field within the
returned JSON body).
\item[{regex}] Regular expressions ran against the result, of which all must pass.
If regex has a ! as the first character, it will attempt to negate the match.
\end{description}
\section{Mongo Module}
\label{sec-3}
This module provides a number of features for testing or waiting for data
in MongoDB.

\subsection{Configuration}
\label{sec-3-1}
Example of all features:
\begin{verbatim}
{
  "mongo" {
    "host" "localhost"
    "port" 27017
    "writeable" true
    "db-user-pass" [{"user" "some"
      "password" "one"
      "db" "test"}]
  }
}
\end{verbatim}
Where:
\begin{description}
\item[{host}] The hostname running the mongodb that should be ran against.
\item[{port}] The port number for mongodb.
\item[{writeable}] Setting this to true (no quotes) enables destructive mongodb
operations. In case live tests are setup, this will prevent damaging
environments by allowing potentially catastrophic operations run. If
not set, or if set to anything other than \verb~true~.
\item[{db-user-pass}] The username, password, and database for authorization.
db :: Database to authenticate against.
user :: Username to authenticate with.
password :: Password to authenticate with.
\end{description}
\subsection{Test}
\label{sec-3-2}
The mongo module has various different actions for dealing with different needs
on mongodb. Only a handful are potentially destructive, and these actions are
managed by the *"writeable"* configuration setting.

All actions have the following arguments after the action argument:
\begin{verbatim}
db|collection
\end{verbatim}

Where:
\begin{description}
\item[{db}] The database to use for this action.
\item[{collection}] The collection to use for this action.
\end{description}

All following argument lists will include all arguments, for simplicity
of reading.

\subsubsection{compare Action}
\label{sec-3-2-1}

This action compares two different records (excluding certain fields) to see
if they are the same based on clojure value comparisons. Used to check if a
sequence of actions is equivalent to simply processing the last document of
a series in our testing.

Arguments are:
\begin{verbatim}
id|mongo|compare|db|collection|query1|query2{|excludes}+
\end{verbatim}

Where:
\begin{description}
\item[{query1}] A strict (keys must be wrapped in quotes) JSON query document for
a single document that has to be compared.
\item[{query2}] A strict (keys must be wrapped in quotes) JSON query document for
a single document that has to be compared.
\item[{excludes}] Fields to be excluded from the comparison. By design \_id must
be specified minimally, but any number of pipe delimited excludes may be
included.
\end{description}
\subsubsection{count Action}
\label{sec-3-2-2}
This action counts all documents in a collection and compares it to an
expected number of documents.

Arguments are:
\begin{verbatim}
id|mongo|count|db|collection|expectation
\end{verbatim}

Where:
\begin{description}
\item[{expectation}] The number of documents expected to be in the collection.
\end{description}
\subsubsection{exists Action}
\label{sec-3-2-3}
Waits for a document to appear in the document, based on a standard query.
One of the few actions that wait a set maximum time (no minimum) for an
external action to be completed.

Arguments are:
\begin{verbatim}
id|mongo|exists|db|collection|query|wait
\end{verbatim}

Where:
\begin{description}
\item[{query}] A strictly formatted JSON document to find the document.
\item[{wait}] The maximum amount of time to wait for the document to appear
in the database.
\end{description}
\subsubsection{remove Action}
\label{sec-3-2-4}
Remove all documents from a mongo db database, based on a query. Requires
*"writeable"* to be set.

Arguments are:
\begin{verbatim}
id|mongo|remove|db|collection{|queries}+
\end{verbatim}

Where:
\begin{description}
\item[{queries}] One or more pipe delimitted queries describing the documents
to remove from the collection.
\end{description}
