core/doc/manual.org
* JMS Module
This module provides the ability to both send to and receive from JMS brokers.
Queues and topics are supported, however durable connections are not. The
publishers will publish all xml in a blank line separated file, or a set of
files in a directory. Only two real actions.

** Configuration
JMS currently only supports a single JMS broker endpoint (not queue or topic,
only the server to which one connects). As this limitation poses problems, it
is a todo to extend configuration to allow this. Such an extention should not
impact current tests.

#+BEGIN_EXAMPLE
{
  "jms" {
    "context" {
      "java.naming.security.principal" "admin"
      "java.naming.security.credentials" ""
      "java.naming.factory.initial" "org.apache.activemq.jndi.ActiveMQInitialContextFactory"
      "java.naming.provider.url" "tcp://localhost:61616"
      "topic.topic" "topic"
      "queue.queue" "queue"
    },
    "destinations" [{
      "destination" "topic"
      "type" "topic"
      "factory" "TopicConnectionFactory"
      "producer-consumer" "producer"
    },{
      "destination" "queue"
      "type" "queue"
      "factory" "QueueConnectionFactory"
      "producer-consumer" "producer"
  },{
      "destination" "topic"
      "type" "topic"
      "factory" "TopicConnectionFactory"
      "producer-consumer" "consumer"
    },{
      "destination" "queue"
      "type" "queue"
      "factory" "QueueConnectionFactory"
      "producer-consumer" "consumer"}]
  }
}
#+END_EXAMPLE

Where:
  - context :: Standard JNDI key value pairs, using the string representation of
    context private static fields. Generally required is:
    1. "java.naming.factory.initial" - Context.INITIAL_CONTEXT_FACTORY.
    2. "java.naming.provider.url" - Context.PROVIDER_URL.
    3. "java.naming.security.principal" - Context.SECURITY_PRINCIPAL
    4. "java.naming.security.credentials" - Context.SECURITY_CREDENTIALS
    5. "topic.topic" "topic" - Represents a topic such that context lookups will
       work if the resource is undefined currently on the broker for ActiveMQ.
  - destinations :: A list of destinations that the test can use. In tests,
    a given test destination is identified by its destination and whether it
    publishes or consumes.
  - destination :: The destination object (name of a queue or topics).
  - type :: Whether this destination is a queue or a topic.
  - factory :: Factory object used to construct this destination.
  - producer-consumer :: Whether this object creates or consumes messages. Valid
    values are producer or consumer, as in the key.

** Tests
There are only two actions in the module, publish and consume.

*** publish Action

The publish action will publish all data from a file or set of files from
a directory. If more than on set of data resides within a file, it should
be separated by empty lines.

Action is:
#+BEGIN_EXAMPLE
id|jms|publish|destination|file-or-directory
#+END_EXAMPLE

Where:
  - destination :: The JMS object as defined by a destination in the config file.
  - file-or-directory :: The file with message body data to send, or a directory
    of such files, separated by blank lines.

*** consume Action
Allows for reading a sequend from a JMS destination, and compares it to a
set of regex of which only one need match.

Arguments are:
#+BEGIN_EXAMPLE
id|jms|consume|destination|number{|regex}+
#+END_EXAMPLE

Where:
  - destination :: A JMS destination defined in the configuration file,
    as defined by the destination field.
  - number :: The number of messages to consume.
  - regex :: One or more patterns of which received messages must match at
    least one.

* Shell Module
The shell module invokes commandline arguments and shell scripts with
arguments, allowing for use of native shell tools to support tests in live
environments.

** Configuration
No configuration, although a todo is to add a path to a predefined scripts
directory. To activate configuration must include:
#+BEGIN_EXAMPLE
{"shell" {}}
#+END_EXAMPLE

** Test
The only action at present is run.

#+BEGIN_EXAMPLE
id|shell|run|command with arguments
#+END_EXAMPLE

Where:
  - command with arguments :: A command, followed by is arguments, space
    separated. Environment variables cannot be used in the arguments.

* Websocket Module
The websocket module is a rare stateful module, that allows for the
testing of websocket services. It is stateful to prevent timeout
issues, or for messages to queue up without consumption if other
components are under test.

** Configuration
You do not need to provide an alias to construct a URL, but using
aliases means that the config file can be setup per environment, and
tests needn’t change (for tests that can be promoted through
environments). Urls should be preceded with ws://.
#+BEGIN_EXAMPLE
{“websocket” {“some-alias” “beginning of the url”
“another-alias” “its beginning”}}
#+END_EXAMPLE

** Test

*** open Action
Opens a websocket connection.
#+BEGIN_EXAMPLE
open|alias|url|handshake
#+END_EXAMPLE
Where:
  - alias :: used to keep track of open connections (need not be
             reflected in config).
  - url ::  is either appended to the end of the url referred to in the
            config file reference for that alias, or it will be used as
            is if not defined.
  - handshake :: is a string that will be sent over the websocket.

*** receive Action
receive|alias|number|wait|or-pattern

Where:
  - alias :: reference to the websocket to send messages on.
  - number :: The numeber of messages to receive form the websocket.
  - wait :: Max amount of time to wait between message receives.
  - or-pattern :: A set of regex patterns, one of which must match each
                  received message.

*** send Action
send|alias|text

Where:
  - alias :: reference to the websocket to send messages to.
  - text :: text to send through web socket.

*** close Action
close|alias

Where:
  - alias :: reference to the websocket connection to close.
* Kestrel Module
** Configuration
Kestrel uses aliases exclusively. Each alias has a map, which defines
its servers. Other options could be added to the map in the
future. Server entries must include the port. Despite the key name,
only a single server is supported at present.
#+BEGIN_EXAMPLE
{“kestrel” {“some-alias” {"servers" “host:port”
“another-alias” {"servers" “host:port”}}
#+END_EXAMPLE
** Test
*** consume Action
Consume text only messages from a kestrel queue.
#+BEGIN_EXAMPLE
consume|alias|queue|number|wait{|regex}+
#+END_EXAMPLE
Where:
  - alias :: used to keep track of Kestrel connections. Must exist in
             config files.
  - queue :: the name of the queue to consume from.
  - number :: the number of messages to pull from Kestrel Queue.
  - wait :: max period of time to wait for a message to become
            available on Kestrel Queue.
  - regex :: One or more patterns to test the text of the message
             against. The patterns are logically ORed together, so that
             if any one passes, they all pass.

*** bin-consume Action
#+BEGIN_EXAMPLE
bin-consume|alias|queue|number|wait
#+END_EXAMPLE
Where:
  - alias :: used to keep track of Kestrel connections. Must exist in
             config files.
  - queue :: the name of the queue to consume from.
  - number :: the number of messages to try to consume from Kestrel
              queue.
  - wait :: how long to wait for each message to arrive at the queue.

