core/doc/manual.tex
\section{JMS Module}
\label{sec-4}
This module provides the ability to both send to and receive from JMS brokers.
Queues and topics are supported, however durable connections are not. The
publishers will publish all xml in a blank line separated file, or a set of
files in a directory. Only two real actions.

\subsection{Configuration}
\label{sec-4-1}
JMS currently only supports a single JMS broker endpoint (not queue or topic,
only the server to which one connects). As this limitation poses problems, it
is a todo to extend configuration to allow this. Such an extention should not
impact current tests.

\begin{verbatim}
{
  "jms" {
    "context" {
      "java.naming.security.principal" "admin"
      "java.naming.security.credentials" ""
      "java.naming.factory.initial" "org.apache.activemq.jndi.ActiveMQInitialContextFactory"
      "java.naming.provider.url" "tcp://localhost:61616"
      "topic.topic" "topic"
      "queue.queue" "queue"
    },
    "destinations" [{
      "destination" "topic"
      "type" "topic"
      "factory" "TopicConnectionFactory"
      "producer-consumer" "producer"
    },{
      "destination" "queue"
      "type" "queue"
      "factory" "QueueConnectionFactory"
      "producer-consumer" "producer"
  },{
      "destination" "topic"
      "type" "topic"
      "factory" "TopicConnectionFactory"
      "producer-consumer" "consumer"
    },{
      "destination" "queue"
      "type" "queue"
      "factory" "QueueConnectionFactory"
      "producer-consumer" "consumer"}]
  }
}
\end{verbatim}

Where:
\begin{description}
\item[{context}] Standard JNDI key value pairs, using the string representation of
context private static fields. Generally required is:
\begin{enumerate}
\item "java.naming.factory.initial" - Context.INITIAL\_CONTEXT\_FACTORY.
\item "java.naming.provider.url" - Context.PROVIDER\_URL.
\item "java.naming.security.principal" - Context.SECURITY\_PRINCIPAL
\item "java.naming.security.credentials" - Context.SECURITY\_CREDENTIALS
\item "topic.topic" "topic" - Represents a topic such that context lookups will
work if the resource is undefined currently on the broker for ActiveMQ.
\end{enumerate}
\item[{destinations}] A list of destinations that the test can use. In tests,
a given test destination is identified by its destination and whether it
publishes or consumes.
\item[{destination}] The destination object (name of a queue or topics).
\item[{type}] Whether this destination is a queue or a topic.
\item[{factory}] Factory object used to construct this destination.
\item[{producer-consumer}] Whether this object creates or consumes messages. Valid
values are producer or consumer, as in the key.
\end{description}
\subsection{Tests}
\label{sec-4-2}
There are only two actions in the module, publish and consume.

\subsubsection{publish Action}
\label{sec-4-2-1}

The publish action will publish all data from a file or set of files from
a directory. If more than on set of data resides within a file, it should
be separated by empty lines.

Action is:
\begin{verbatim}
id|jms|publish|destination|file-or-directory
\end{verbatim}

Where:
\begin{description}
\item[{destination}] The JMS object as defined by a destination in the config file.
\item[{file-or-directory}] The file with message body data to send, or a directory
of such files, separated by blank lines.
\end{description}
\subsubsection{consume Action}
\label{sec-4-2-2}
Allows for reading a sequend from a JMS destination, and compares it to a
set of regex of which only one need match.

Arguments are:
\begin{verbatim}
id|jms|consume|destination|number{|regex}+
\end{verbatim}

Where:
\begin{description}
\item[{destination}] A JMS destination defined in the configuration file,
as defined by the destination field.
\item[{number}] The number of messages to consume.
\item[{regex}] One or more patterns of which received messages must match at
least one.
\end{description}
\section{Shell Module}
\label{sec-5}
The shell module invokes commandline arguments and shell scripts with
arguments, allowing for use of native shell tools to support tests in live
environments.

\subsection{Configuration}
\label{sec-5-1}
No configuration, although a todo is to add a path to a predefined scripts
directory. To activate configuration must include:
\begin{verbatim}
{"shell" {}}
\end{verbatim}
\subsection{Test}
\label{sec-5-2}
The only action at present is run.

\begin{verbatim}
id|shell|run|command with arguments
\end{verbatim}

Where:
\begin{description}
\item[{command with arguments}] A command, followed by is arguments, space
separated. Environment variables cannot be used in the arguments.
\end{description}
\section{Websocket Module}
\label{sec-6}
The websocket module is a rare stateful module, that allows for the
testing of websocket services. It is stateful to prevent timeout
issues, or for messages to queue up without consumption if other
components are under test.

\subsection{Configuration}
\label{sec-6-1}
You do not need to provide an alias to construct a URL, but using
aliases means that the config file can be setup per environment, and
tests needn’t change (for tests that can be promoted through
environments). Urls should be preceded with ws://.
\begin{verbatim}
{“websocket” {“some-alias” “beginning of the url”
“another-alias” “its beginning”}}
\end{verbatim}
\subsection{Test}
\label{sec-6-2}

\subsubsection{open Action}
\label{sec-6-2-1}
Opens a websocket connection.
\begin{verbatim}
open|alias|url|handshake
\end{verbatim}
Where:
\begin{description}
\item[{alias}] used to keep track of open connections (need not be
reflected in config).
\item[{url}] is either appended to the end of the url referred to in the
config file reference for that alias, or it will be used as
is if not defined.
\item[{handshake}] is a string that will be sent over the websocket.
\end{description}
\subsubsection{receive Action}
\label{sec-6-2-2}
receive|alias|number|wait|or-pattern

Where:
\begin{description}
\item[{alias}] reference to the websocket to send messages on.
\item[{number}] The numeber of messages to receive form the websocket.
\item[{wait}] Max amount of time to wait between message receives.
\item[{or-pattern}] A set of regex patterns, one of which must match each
received message.
\end{description}
\subsubsection{send Action}
\label{sec-6-2-3}
send|alias|text

Where:
\begin{description}
\item[{alias}] reference to the websocket to send messages to.
\item[{text}] text to send through web socket.
\end{description}
\subsubsection{close Action}
\label{sec-6-2-4}
close|alias

Where:
\begin{description}
\item[{alias}] reference to the websocket connection to close.
\end{description}

\section{Kestrel Module}
\label{sec-7}
\subsection{Configuration}
\label{sec-7-1}
Kestrel uses aliases exclusively. Each alias has a map, which defines
its servers. Other options could be added to the map in the
future. Server entries must include the port. Despite the key name,
only a single server is supported at present.
\begin{verbatim}
{“kestrel” {“some-alias” {"servers" “host:port”
“another-alias” {"servers" “host:port”}}
\end{verbatim}

\subsection{Test}
\label{sec-7-2}
\subsubsection{consume Action}
\label{sec-7-2-1}
Consume text only messages from a kestrel queue.
\begin{verbatim}
consume|alias|queue|number|wait{|regex}+
\end{verbatim}
Where:
\begin{description}
\item[{alias}] used to keep track of Kestrel connections. Must exist in
config files.
\item[{queue}] the name of the queue to consume from.
\item[{number}] the number of messages to pull from Kestrel Queue.
\item[{wait}] max period of time to wait for a message to become
available on Kestrel Queue.
\item[{regex}] One or more patterns to test the text of the message
against. The patterns are logically ORed together, so that
if any one passes, they all pass.
\end{description}
\subsubsection{bin-consume Action}
\label{sec-7-2-2}
\begin{verbatim}
bin-consume|alias|queue|number|wait
\end{verbatim}
Where:
\begin{description}
\item[{alias}] used to keep track of Kestrel connections. Must exist in
config files.
\item[{queue}] the name of the queue to consume from.
\item[{number}] the number of messages to try to consume from Kestrel
queue.
\item[{wait}] how long to wait for each message to arrive at the queue.
\end{description}
