core/doc/manual.tex
\subsubsection{publish Action}
\label{sec-7-2-3}
\begin{verbatim}
publish|alias|queue|file-or-dir
\end{verbatim}
Where:
\begin{description}
\item[{alias}] used to keep track of Kestrel connections. Must exist in
config files.
\item[{queue}] the name of the queue to publish to.
\item[{file-or-directory}] load an xml file or directory of files. Uses
the same module as jms.
\end{description}
\subsubsection{bin-publish Action}
\label{sec-7-2-4}
\begin{verbatim}
bin-publish|alias|queue|file
\end{verbatim}
Where:
\begin{description}
\item[{alias}] used to keep track of Kestrel connections. Must exist in
config files.
\item[{queue}] the name of the queue to publish to.
\item[{file}] load a binary file into a Kestrel Queue. At present it will
load an entire file. Other options may present themselves later.
\end{description}
\subsubsection{peek Action}
\label{sec-7-2-5}
\begin{verbatim}
peek|alias|queue|wait{|regex}+
\end{verbatim}
Where:
\begin{description}
\item[{alias}] used to keep track of Kestrel connections. Must exist in
config files.
\item[{queue}] the name of the queue to peek at.
\item[{wait}] The period of time to wait for a message to appear on the
top of the queue.
\item[{regex}] A list of regex patterns, one of which must match the
message peeked at from the top of the queue.
\end{description}
\subsubsection{delete Action}
\label{sec-7-2-6}
\begin{verbatim}
publish|alias|queue
\end{verbatim}
Where:
\begin{description}
\item[{alias}] used to keep track of Kestrel connections. Must exist in
config files.
\item[{queue}] the name of the queue to delete.
\end{description}
\section{Running Tests}
\label{sec-8}
To run a test:
\begin{verbatim}
cd test/directory # should have the test .csv
java -jar path/to/bandit.jar bandit.core config.clj test.csv
\end{verbatim}

It is useful to write scripts to wrap up the configuration, and to move
into directories holding tests with related data.

NOTE: In lab7 you can use:

\begin{verbatim}
./check test
\end{verbatim}

This will move into the directory with the test, and run it, so all
relative paths will be related directly to the test.csv file.
\section{Sample Tests}
\label{sec-9}

\subsection{Simple Product Text}
\label{sec-9-1}
\begin{scriptsize}
\begin{verbatim}
#Clear everything, just this test
Remove all product|mongo|remove|smcdb          |product|{}
Remove journal    |mongo|remove|smcJournal     |product|{}
Remove historical |mongo|remove|smcHistoricalDb|product|{}
Remove failed     |mongo|remove|failedMessages |smcFailedMessages|{}

#publish messages to a queue
publish all xml messages|jms|publish|cmb.cibtech.na.smc_160829_isgcloud.ABS|products.xml

#Verify that all messages are consumed, pause until they are consumed
Verify exists _id|mongo|exists|smcdb|product|{"_id":"417062831"}|600
Verify exists _id|mongo|exists|smcdb|product|{"_id":"722591051"}|600
Verify exists _id|mongo|exists|smcdb|product|{"_id":"990415051"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"141895090"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"141884611"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"141907120"}|600

#Verify counts
Verify 9244 messages in smcdb|mongo|count|smcdb|product|9244|{}
Verify 756 messages in failedMessages|mongo|count|failedMessages|smcFailedMessages|756|{}
\end{verbatim}
\end{scriptsize}
\subsection{Failed Messages Test}
\label{sec-9-2}
\begin{scriptsize}
\begin{verbatim}
#Clear everything, just this test
Remove all product|mongo|remove|smcdb          |product|{}
Remove journal    |mongo|remove|smcJournal     |product|{}
Remove historical |mongo|remove|smcHistoricalDb|product|{}
Remove failed     |mongo|remove|failedMessages |smcFailedMessages|{}

#Backup current properties
Backup properties|shell|run|../scripts/backup-properties.sh

#Break the topology
Use historicalDB free properties|shell|run|../scripts/load-properties.sh ../properties/no-smcHistoricalDb.properties

#Start the topology
Start small-products for test|shell|run|../scripts/start-bos.sh product-small

#publish messages to a queue
Publish all xml messages|jms|publish|cmb.cibtech.na.smc_160829_isgcloud.ABS|only-good.xml

#Verify that all messages are consumed
#It is okay if some of theese fail, due to processing time in large loads
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"138260714"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"150195227"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"150514099"}|600

#Verify counts in failure
Verify 0 messages in db|mongo|count|smcHistoricalDb|product|0|{}
Verify 9244 messages in failedMessages|mongo|count|failedMessages|smcFailedMessages|9244|{}
Verify 9244 messages in smcdb|mongo|count|smcdb|product|9244|{}

#Stop the topology
Stop the topology|shell|run|../scripts/stop-bos.sh product-small

#Remove all of the failed messages for PRODUCT, they are known bad anyways
Remove failed PRODUCT|mongo|remove|failedMessages|smcFailedMessages|{"Type":"PRODUCT"}

#Install no smcdb properties
Install correct properties|shell|run|../scripts/load-properties.sh ../properties/no-smcdb.properties

#Restart the topology
Start small-products for test|shell|run|../scripts/start-bos.sh product-small

#publish a few more messages, so we have bad xml that's valid
Publish smcdb miss messages|jms|publish|cmb.cibtech.na.smc_160829_isgcloud.ABS|smcdb-fail.xml

#Wait for messages to stop processing
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"98572177","Type":"PRODUCT"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"12680143","Type":"P
RODUCT"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"150060330","Type":"P
RODUCT"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"150149037","Type":"P
RODUCT"}|600
Verify exists failed ObjectId|mongo|exists|failedMessages|smcFailedMessages|{"ObjectId":"150343828","Type":"P
RODUCT"}|600

#Stop the topology
Stop small products|shell|run|../scripts/stop-bos.sh product-small

#run the kestrel topology
Run Kestrel Topology|shell|run|../scripts/start-bos.sh product lab7-dl380-11

#Run the failure pump
Run smcFailedMessagePump|shell|run|../scripts/start-pump.sh SmcFailJournal

#Verify all records are pushed to db
Verify exists _id|mongo|exists|smcHistoricalDb|product|{"id":"417062831"}|600
Verify exists _id|mongo|exists|smcHistoricalDb|product|{"id":"722591051"}|600
Verify exists _id|mongo|exists|smcHistoricalDb|product|{"id":"990415051"}|600

#Verify counts are correct
#Unless we figure out how to 'fix' failedMessages to seed good xml for bad
Verify counts 9244 + 666|mongo|count|smcHistoricalDb|product|9910|{}
#Consumed messages should be removed from failed messages
Verify failed messages empty|mongo|count|failedMessages|smcFailedMessages|0|{}

#shutdown the pump
Stop pump|shell|run|../scripts/stop-pump.sh

#stop topology
Stop kestrel topology|shell|run|../scripts/stop-bos.sh product

#restore old properties
Restore old properties|shell|run|../scripts/restore-properties.sh
\end{verbatim}
\end{scriptsize}
% Emacs 24.3.1 (Org mode 8.0)
\end{document}
